case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// Generated by src/case.py — do not edit by hand.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    aerofoil        { type noSlip; }
    inlet           { type freestreamVelocity; freestreamValue uniform (1 0 0); }
    outlet          { type freestreamVelocity; freestreamValue uniform (1 0 0); }
    topAndBottom    { type freestreamVelocity; freestreamValue uniform (1 0 0); }
    frontAndBack    { type empty; }
}
