case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// Generated by src/case.py — do not edit by hand.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.77778e-11;

boundaryField
{
    aerofoil        { type fixedValue; value uniform 1e-12; }
    inlet           { type freestream; freestreamValue uniform 2.77778e-11; }
    outlet          { type freestream; freestreamValue uniform 2.77778e-11; }
    topAndBottom    { type freestream; freestreamValue uniform 2.77778e-11; }
    frontAndBack    { type empty; }
}
