case/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// Generated by src/case.py — do not edit by hand.

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.66667e-10;

boundaryField
{
    aerofoil        { type nutLowReWallFunction; value uniform 0; }
    inlet           { type freestream; freestreamValue uniform 1.66667e-10; }
    outlet          { type freestream; freestreamValue uniform 1.66667e-10; }
    topAndBottom    { type freestream; freestreamValue uniform 1.66667e-10; }
    frontAndBack    { type empty; }
}
