case/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// Generated by src/case.py — do not edit by hand.

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.166667;

boundaryField
{
    aerofoil        { type omegaWallFunction; value uniform 1e-8; }
    inlet           { type freestream; freestreamValue uniform 0.166667; }
    outlet          { type freestream; freestreamValue uniform 0.166667; }
    topAndBottom    { type freestream; freestreamValue uniform 0.166667; }
    frontAndBack    { type empty; }
}
