case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// Generated by src/case.py — do not edit by hand.

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    aerofoil        { type zeroGradient; }
    inlet           { type freestreamPressure; freestreamValue uniform 0; }
    outlet          { type freestreamPressure; freestreamValue uniform 0; }
    topAndBottom    { type freestreamPressure; freestreamValue uniform 0; }
    frontAndBack    { type empty; }
}
