case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// Generated by src/case.py — do not edit by hand.

transportModel  Newtonian;
nu              1.666666667e-07;
