case/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// Generated by src/case.py — do not edit by hand.

simulationType  RAS;

RAS
{
    model        kOmegaSST;
    turbulence   on;
    printCoeffs  on;
}
