case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by src/cgrid.py — do not edit by hand.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (1 0 0)
    (0.5 0.052861502 0)
    (0 0 0)
    (0.5 -0.052861502 0)
    (1 12 0)
    (-7.4852814 8.4852814 0)
    (-11 0 0)
    (-7.4852814 -8.4852814 0)
    (1 -12 0)
    (21 12 0)
    (21 0 0)
    (21 -12 0)
    (1 0 0.02)
    (0.5 0.052861502 0.02)
    (0 0 0.02)
    (0.5 -0.052861502 0.02)
    (1 12 0.02)
    (-7.4852814 8.4852814 0.02)
    (-11 0 0.02)
    (-7.4852814 -8.4852814 0.02)
    (1 -12 0.02)
    (21 12 0.02)
    (21 0 0.02)
    (21 -12 0.02)
);

blocks
(
    hex (0 4 5 1 12 16 17 13) (60 40 1) simpleGrading (243202.44380777073 1 1)  // upper aft
    hex (1 5 6 2 13 17 18 14) (60 40 1) simpleGrading (243202.44380777073 1 1)  // upper fwd
    hex (2 6 7 3 14 18 19 15) (60 40 1) simpleGrading (243202.44380777073 1 1)  // lower fwd
    hex (3 7 8 0 15 19 20 12) (60 40 1) simpleGrading (243202.44380777073 1 1)  // lower aft
    hex (0 10 9 4 12 22 21 16) (60 60 1) simpleGrading (12.0 243202.44380777073 1)  // wake upper
    hex (0 8 11 10 12 20 23 22) (60 60 1) simpleGrading (243202.44380777073 12.0 1)  // wake lower
);

edges
(
    polyLine 0 1
    (
        (0.99961452 5.601576e-05 0)
        (0.99845867 0.00022380864 0)
        (0.99653423 0.0005026182 0)
        (0.99384417 0.00089118634 0)
        (0.99039264 0.0013877709 0)
        (0.98618496 0.0019901642 0)
        (0.98122762 0.0026957163 0)
        (0.97552826 0.0035013623 0)
        (0.96909567 0.0044036522 0)
        (0.96193977 0.0053987845 0)
        (0.95407159 0.0064826409 0)
        (0.94550326 0.0076508216 0)
        (0.936248 0.0088986821 0)
        (0.92632008 0.010221368 0)
        (0.91573481 0.011613847 0)
        (0.9045085 0.013070946 0)
        (0.89265847 0.014587372 0)
        (0.88020298 0.016157745 0)
        (0.86716125 0.017776613 0)
        (0.85355339 0.019438476 0)
        (0.83940037 0.021137794 0)
        (0.82472402 0.022868997 0)
        (0.80954697 0.024626489 0)
        (0.79389263 0.02640465 0)
        (0.77778512 0.028197832 0)
        (0.76124928 0.030000351 0)
        (0.74431062 0.031806478 0)
        (0.72699525 0.03361043 0)
        (0.70932987 0.035406355 0)
        (0.69134172 0.037188322 0)
        (0.67305853 0.038950307 0)
        (0.6545085 0.040686184 0)
        (0.63572022 0.042389716 0)
        (0.61672268 0.044054552 0)
        (0.59754516 0.045674223 0)
        (0.57821723 0.047242149 0)
        (0.5587687 0.048751645 0)
        (0.53922955 0.050195938 0)
        (0.51962991 0.051568186 0)
    )
    polyLine 1 2
    (
        (0.48037009 0.054068992 0)
        (0.46077045 0.055183788 0)
        (0.4412313 0.056199094 0)
        (0.42178277 0.057108232 0)
        (0.40245484 0.057904698 0)
        (0.38327732 0.058582213 0)
        (0.36427978 0.059134784 0)
        (0.3454915 0.059556764 0)
        (0.32694147 0.059842909 0)
        (0.30865828 0.059988433 0)
        (0.29067013 0.059989072 0)
        (0.27300475 0.059841127 0)
        (0.25568938 0.059541514 0)
        (0.23875072 0.059087806 0)
        (0.22221488 0.058478262 0)
        (0.20610737 0.057711856 0)
        (0.19045303 0.056788292 0)
        (0.17527598 0.055708005 0)
        (0.16059963 0.054472164 0)
        (0.14644661 0.05308265 0)
        (0.13283875 0.051542037 0)
        (0.11979702 0.049853549 0)
        (0.10734153 0.048021019 0)
        (0.095491503 0.046048828 0)
        (0.084265194 0.043941846 0)
        (0.073679918 0.041705353 0)
        (0.063751996 0.039344962 0)
        (0.054496738 0.036866535 0)
        (0.045928413 0.034276091 0)
        (0.038060234 0.031579718 0)
        (0.030904332 0.028783477 0)
        (0.024471742 0.025893313 0)
        (0.018772382 0.022914964 0)
        (0.01381504 0.01985388 0)
        (0.0096073598 0.016715136 0)
        (0.0061558297 0.013503368 0)
        (0.0034657715 0.010222706 0)
        (0.0015413331 0.0068767182 0)
        (0.00038548188 0.0034683722 0)
    )
    polyLine 2 3
    (
        (0.00038548188 -0.0034683722 0)
        (0.0015413331 -0.0068767182 0)
        (0.0034657715 -0.010222706 0)
        (0.0061558297 -0.013503368 0)
        (0.0096073598 -0.016715136 0)
        (0.01381504 -0.01985388 0)
        (0.018772382 -0.022914964 0)
        (0.024471742 -0.025893313 0)
        (0.030904332 -0.028783477 0)
        (0.038060234 -0.031579718 0)
        (0.045928413 -0.034276091 0)
        (0.054496738 -0.036866535 0)
        (0.063751996 -0.039344962 0)
        (0.073679918 -0.041705353 0)
        (0.084265194 -0.043941846 0)
        (0.095491503 -0.046048828 0)
        (0.10734153 -0.048021019 0)
        (0.11979702 -0.049853549 0)
        (0.13283875 -0.051542037 0)
        (0.14644661 -0.05308265 0)
        (0.16059963 -0.054472164 0)
        (0.17527598 -0.055708005 0)
        (0.19045303 -0.056788292 0)
        (0.20610737 -0.057711856 0)
        (0.22221488 -0.058478262 0)
        (0.23875072 -0.059087806 0)
        (0.25568938 -0.059541514 0)
        (0.27300475 -0.059841127 0)
        (0.29067013 -0.059989072 0)
        (0.30865828 -0.059988433 0)
        (0.32694147 -0.059842909 0)
        (0.3454915 -0.059556764 0)
        (0.36427978 -0.059134784 0)
        (0.38327732 -0.058582213 0)
        (0.40245484 -0.057904698 0)
        (0.42178277 -0.057108232 0)
        (0.4412313 -0.056199094 0)
        (0.46077045 -0.055183788 0)
        (0.48037009 -0.054068992 0)
    )
    polyLine 3 0
    (
        (0.51962991 -0.051568186 0)
        (0.53922955 -0.050195938 0)
        (0.5587687 -0.048751645 0)
        (0.57821723 -0.047242149 0)
        (0.59754516 -0.045674223 0)
        (0.61672268 -0.044054552 0)
        (0.63572022 -0.042389716 0)
        (0.6545085 -0.040686184 0)
        (0.67305853 -0.038950307 0)
        (0.69134172 -0.037188322 0)
        (0.70932987 -0.035406355 0)
        (0.72699525 -0.03361043 0)
        (0.74431062 -0.031806478 0)
        (0.76124928 -0.030000351 0)
        (0.77778512 -0.028197832 0)
        (0.79389263 -0.02640465 0)
        (0.80954697 -0.024626489 0)
        (0.82472402 -0.022868997 0)
        (0.83940037 -0.021137794 0)
        (0.85355339 -0.019438476 0)
        (0.86716125 -0.017776613 0)
        (0.88020298 -0.016157745 0)
        (0.89265847 -0.014587372 0)
        (0.9045085 -0.013070946 0)
        (0.91573481 -0.011613847 0)
        (0.92632008 -0.010221368 0)
        (0.936248 -0.0088986821 0)
        (0.94550326 -0.0076508216 0)
        (0.95407159 -0.0064826409 0)
        (0.96193977 -0.0053987845 0)
        (0.96909567 -0.0044036522 0)
        (0.97552826 -0.0035013623 0)
        (0.98122762 -0.0026957163 0)
        (0.98618496 -0.0019901642 0)
        (0.99039264 -0.0013877709 0)
        (0.99384417 -0.00089118634 0)
        (0.99653423 -0.0005026182 0)
        (0.99845867 -0.00022380864 0)
        (0.99961452 -5.601576e-05 0)
    )
    arc 4 5 (-3.5922012 11.086554 0)
    arc 5 6 (-10.086554 4.5922012 0)
    arc 6 7 (-10.086554 -4.5922012 0)
    arc 7 8 (-3.5922012 -11.086554 0)
    polyLine 12 13
    (
        (0.99961452 5.601576e-05 0.02)
        (0.99845867 0.00022380864 0.02)
        (0.99653423 0.0005026182 0.02)
        (0.99384417 0.00089118634 0.02)
        (0.99039264 0.0013877709 0.02)
        (0.98618496 0.0019901642 0.02)
        (0.98122762 0.0026957163 0.02)
        (0.97552826 0.0035013623 0.02)
        (0.96909567 0.0044036522 0.02)
        (0.96193977 0.0053987845 0.02)
        (0.95407159 0.0064826409 0.02)
        (0.94550326 0.0076508216 0.02)
        (0.936248 0.0088986821 0.02)
        (0.92632008 0.010221368 0.02)
        (0.91573481 0.011613847 0.02)
        (0.9045085 0.013070946 0.02)
        (0.89265847 0.014587372 0.02)
        (0.88020298 0.016157745 0.02)
        (0.86716125 0.017776613 0.02)
        (0.85355339 0.019438476 0.02)
        (0.83940037 0.021137794 0.02)
        (0.82472402 0.022868997 0.02)
        (0.80954697 0.024626489 0.02)
        (0.79389263 0.02640465 0.02)
        (0.77778512 0.028197832 0.02)
        (0.76124928 0.030000351 0.02)
        (0.74431062 0.031806478 0.02)
        (0.72699525 0.03361043 0.02)
        (0.70932987 0.035406355 0.02)
        (0.69134172 0.037188322 0.02)
        (0.67305853 0.038950307 0.02)
        (0.6545085 0.040686184 0.02)
        (0.63572022 0.042389716 0.02)
        (0.61672268 0.044054552 0.02)
        (0.59754516 0.045674223 0.02)
        (0.57821723 0.047242149 0.02)
        (0.5587687 0.048751645 0.02)
        (0.53922955 0.050195938 0.02)
        (0.51962991 0.051568186 0.02)
    )
    polyLine 13 14
    (
        (0.48037009 0.054068992 0.02)
        (0.46077045 0.055183788 0.02)
        (0.4412313 0.056199094 0.02)
        (0.42178277 0.057108232 0.02)
        (0.40245484 0.057904698 0.02)
        (0.38327732 0.058582213 0.02)
        (0.36427978 0.059134784 0.02)
        (0.3454915 0.059556764 0.02)
        (0.32694147 0.059842909 0.02)
        (0.30865828 0.059988433 0.02)
        (0.29067013 0.059989072 0.02)
        (0.27300475 0.059841127 0.02)
        (0.25568938 0.059541514 0.02)
        (0.23875072 0.059087806 0.02)
        (0.22221488 0.058478262 0.02)
        (0.20610737 0.057711856 0.02)
        (0.19045303 0.056788292 0.02)
        (0.17527598 0.055708005 0.02)
        (0.16059963 0.054472164 0.02)
        (0.14644661 0.05308265 0.02)
        (0.13283875 0.051542037 0.02)
        (0.11979702 0.049853549 0.02)
        (0.10734153 0.048021019 0.02)
        (0.095491503 0.046048828 0.02)
        (0.084265194 0.043941846 0.02)
        (0.073679918 0.041705353 0.02)
        (0.063751996 0.039344962 0.02)
        (0.054496738 0.036866535 0.02)
        (0.045928413 0.034276091 0.02)
        (0.038060234 0.031579718 0.02)
        (0.030904332 0.028783477 0.02)
        (0.024471742 0.025893313 0.02)
        (0.018772382 0.022914964 0.02)
        (0.01381504 0.01985388 0.02)
        (0.0096073598 0.016715136 0.02)
        (0.0061558297 0.013503368 0.02)
        (0.0034657715 0.010222706 0.02)
        (0.0015413331 0.0068767182 0.02)
        (0.00038548188 0.0034683722 0.02)
    )
    polyLine 14 15
    (
        (0.00038548188 -0.0034683722 0.02)
        (0.0015413331 -0.0068767182 0.02)
        (0.0034657715 -0.010222706 0.02)
        (0.0061558297 -0.013503368 0.02)
        (0.0096073598 -0.016715136 0.02)
        (0.01381504 -0.01985388 0.02)
        (0.018772382 -0.022914964 0.02)
        (0.024471742 -0.025893313 0.02)
        (0.030904332 -0.028783477 0.02)
        (0.038060234 -0.031579718 0.02)
        (0.045928413 -0.034276091 0.02)
        (0.054496738 -0.036866535 0.02)
        (0.063751996 -0.039344962 0.02)
        (0.073679918 -0.041705353 0.02)
        (0.084265194 -0.043941846 0.02)
        (0.095491503 -0.046048828 0.02)
        (0.10734153 -0.048021019 0.02)
        (0.11979702 -0.049853549 0.02)
        (0.13283875 -0.051542037 0.02)
        (0.14644661 -0.05308265 0.02)
        (0.16059963 -0.054472164 0.02)
        (0.17527598 -0.055708005 0.02)
        (0.19045303 -0.056788292 0.02)
        (0.20610737 -0.057711856 0.02)
        (0.22221488 -0.058478262 0.02)
        (0.23875072 -0.059087806 0.02)
        (0.25568938 -0.059541514 0.02)
        (0.27300475 -0.059841127 0.02)
        (0.29067013 -0.059989072 0.02)
        (0.30865828 -0.059988433 0.02)
        (0.32694147 -0.059842909 0.02)
        (0.3454915 -0.059556764 0.02)
        (0.36427978 -0.059134784 0.02)
        (0.38327732 -0.058582213 0.02)
        (0.40245484 -0.057904698 0.02)
        (0.42178277 -0.057108232 0.02)
        (0.4412313 -0.056199094 0.02)
        (0.46077045 -0.055183788 0.02)
        (0.48037009 -0.054068992 0.02)
    )
    polyLine 15 12
    (
        (0.51962991 -0.051568186 0.02)
        (0.53922955 -0.050195938 0.02)
        (0.5587687 -0.048751645 0.02)
        (0.57821723 -0.047242149 0.02)
        (0.59754516 -0.045674223 0.02)
        (0.61672268 -0.044054552 0.02)
        (0.63572022 -0.042389716 0.02)
        (0.6545085 -0.040686184 0.02)
        (0.67305853 -0.038950307 0.02)
        (0.69134172 -0.037188322 0.02)
        (0.70932987 -0.035406355 0.02)
        (0.72699525 -0.03361043 0.02)
        (0.74431062 -0.031806478 0.02)
        (0.76124928 -0.030000351 0.02)
        (0.77778512 -0.028197832 0.02)
        (0.79389263 -0.02640465 0.02)
        (0.80954697 -0.024626489 0.02)
        (0.82472402 -0.022868997 0.02)
        (0.83940037 -0.021137794 0.02)
        (0.85355339 -0.019438476 0.02)
        (0.86716125 -0.017776613 0.02)
        (0.88020298 -0.016157745 0.02)
        (0.89265847 -0.014587372 0.02)
        (0.9045085 -0.013070946 0.02)
        (0.91573481 -0.011613847 0.02)
        (0.92632008 -0.010221368 0.02)
        (0.936248 -0.0088986821 0.02)
        (0.94550326 -0.0076508216 0.02)
        (0.95407159 -0.0064826409 0.02)
        (0.96193977 -0.0053987845 0.02)
        (0.96909567 -0.0044036522 0.02)
        (0.97552826 -0.0035013623 0.02)
        (0.98122762 -0.0026957163 0.02)
        (0.98618496 -0.0019901642 0.02)
        (0.99039264 -0.0013877709 0.02)
        (0.99384417 -0.00089118634 0.02)
        (0.99653423 -0.0005026182 0.02)
        (0.99845867 -0.00022380864 0.02)
        (0.99961452 -5.601576e-05 0.02)
    )
    arc 16 17 (-3.5922012 11.086554 0.02)
    arc 17 18 (-10.086554 4.5922012 0.02)
    arc 18 19 (-10.086554 -4.5922012 0.02)
    arc 19 20 (-3.5922012 -11.086554 0.02)
);

boundary
(
    aerofoil
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
            (2 3 15 14)
            (3 0 12 15)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 5 17 16)
            (5 6 18 17)
            (6 7 19 18)
            (7 8 20 19)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9 10 22 21)
            (10 11 23 22)
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (4 9 21 16)
            (11 8 20 23)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 8 0)
            (0 10 9 4)
            (0 8 11 10)
            (13 17 16 12)
            (14 18 17 13)
            (15 19 18 14)
            (12 20 19 15)
            (16 21 22 12)
            (22 23 20 12)
        );
    }
);

