case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// Generated by src/case.py — do not edit by hand.

ddtSchemes      { default steadyState; }

// Unlimited. `cellLimited Gauss linear 1` is the usual safe default and it is
// wrong here: on this mesh it reported Cl = 0.049 for a symmetric section at
// zero incidence, where symmetry requires zero, and inflated Cd from 0.0116 to
// 0.0196. The limiter is nonlinear, so it clips gradients asymmetrically in the
// boundary layer and adds spurious diffusion. A structured C-grid with maximum
// non-orthogonality under 70 does not need it. Re-introduce a limiter only if a
// coarser or worse-quality mesh will not converge without one — and re-check
// the zero-incidence lift afterwards if you do.
gradSchemes     { default Gauss linear; }

// Bounded second-order upwind on the divergence terms. Pure linear is
// unbounded and diverges on a steady run; first-order upwind converges
// obediently and smears the boundary layer enough to spoil the drag.
divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,k)      bounded Gauss limitedLinear 1;
    div(phi,omega)  bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
wallDist        { method meshWave; }
